# Build training and testing dataset to predict the probability of a survival of a person based on 
- gender 
- age and 
- passenger-class.

                                                                                            Sonu S. Dutta
                                                                                            Roll no-4
                                                                                            TE (Entc)

In [1]:
import pandas as pd

In [2]:
df = pd.read_csv('titanic.csv')
df.head(2)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,892,0,3,"Kelly, Mr. James",male,34.5,0,0,330911,7.8292,NaN,Q
1,893,1,3,"Wilkes, Mrs. James (Ellen Needs)",female,47.0,1,0,363272,7.0000,NaN,S

In [3]:
df.columns

Index(['PassengerId', 'Survived', 'Pclass', 'Name', 'Sex', 'Age', 'SibSp',
       'Parch', 'Ticket', 'Fare', 'Cabin', 'Embarked'],
      dtype='object')

In [4]:
final = df[['Sex','Age','Pclass','Survived']]

In [5]:
final[:2]

      Sex   Age  Pclass  Survived
0    male  34.5       3         0
1  female  47.0       3         1

In [6]:
final = final.rename({'Sex':'Gender'},axis=1)

In [7]:
final[:3]

   Gender   Age  Pclass  Survived
0    male  34.5       3         0
1  female  47.0       3         1
2    male  62.0       2         0

In [8]:
final.isna().sum()

Gender       0
Age         86
Pclass       0
Survived     0
dtype: int64

In [9]:
round(final['Age'].mean())

30

In [10]:
# fill missing values in age column
final['Age'] = final.Age.fillna(30)

In [11]:
final

     Gender   Age  Pclass  Survived
0      male  34.5       3         0
1    female  47.0       3         1
2      male  62.0       2         0
3      male  27.0       3         0
4    female  22.0       3         1
..      ...   ...     ...       ...
413    male  30.0       3         0
414  female  39.0       1         1
415    male  38.5       3         0
416    male  30.0       3         0
417    male  30.0       3         0

[418 rows x 4 columns]

# Lets create input and output

In [12]:
# iloc[:,:-1]--->until the second-last column
X = final.iloc[:,:-1]

In [13]:
X[:2]

   Gender   Age  Pclass
0    male  34.5       3
1  female  47.0       3

In [14]:
y = final.Survived
y[:3]

0    0
1    1
2    0
Name: Survived, dtype: int64

In [15]:
final.isna().sum()

Gender      0
Age         0
Pclass      0
Survived    0
dtype: int64

## Splitting of data

In [16]:
# Split the dataset into train and test data
# use sklearn
from sklearn.model_selection import train_test_split

In [17]:
X_train, X_test, y_train, y_test = train_test_split(X,y,train_size=.8,random_state=42)

In [18]:
X_train[:4]

    Gender   Age  Pclass
336   male  32.0       2
31    male  24.0       2
84    male  30.0       2
287   male  24.0       1

In [19]:
X_test[:4]

     Gender   Age  Pclass
321    male  25.0       3
324  female  39.0       1
388    male  21.0       3
56     male  35.0       3

In [20]:
len(X)

418

In [21]:
# 80% of total data
418 * .8

334.40000000000003

In [22]:
len(X_train)

334

In [23]:
#how mcuh for test data???
418 -334

84

In [24]:
len(X_test)

84

In [25]:
len(X_train)+len(X_test)

418

In [27]:
# Exporting the training dataset:
# Adding training-set of y to x
titanic_train = X_train
titanic_train['Servived'] = y_train

In [28]:
# making csv file
X_train.to_csv('titanic_train.csv', index=False)

In [29]:
# Adding testing-set of y to x
titanic_test = X_test
titanic_test['Servived'] = y_test

In [30]:
# making csv file
X_test.to_csv('titanic_test.csv', index=False)